from dataclasses import dataclass


@dataclass
class UserRegistration:
    name = 'Как вас зовут?'
    age = 'Сколько вам лет?'
    phone_number = 'Укажите свой номер телефона (c +7 в начале), чтобы заказчик или работник точно смогли с вами связаться'
    description = 'Напишите пару слов о себе (сильные стороны, навыки, умения), чтобы заказчик или работник понимали с кем сотрудничают'
    notifications = 'Вы можете включить уведомления о новых заказ для выполнения. Включить?'
    location = 'Отправьте свою геопозицию, относительно которой мы будем искать новые заказы...'


@dataclass
class MyProfile:
    name_successfully = 'Вы успешно сменили имя профиля!'
    age_successfully = 'Вы успешно сменили возраст профиля!'
    phone_number_successfully = 'Вы успешно сменили номер телефона профиля!'
    description_successfully = 'Вы успешно сменили краткое описание профиля!'
    profile_successfully = 'Вы успешно изменили свой профиль!'


@dataclass
class General:
    menu = "Главное меню:"


class Warnings:
    orders_limit_for_executor = 'Количество ваших заказов на выполении достигло максимума.\n' + \
                                'Завершите ранее полученные заказы, чтобы получить новый.\n' + \
                                'Сделать это можно в Моих заказах (/my_orders)'

    orders_limit_for_creator = 'Количество ваших заказов достигло максимума.\n' + \
                               'Завершите или удалите ранее созданые заказы, чтобы создать новый.\n' + \
                               'Сделать это можно в Моих заказах (/my_orders)'

    orders_absence = 'Пока доступных заказов нет 😥\n\n' +\
                     'Попробуйте обновить геопозицию или включить уведомления о новых заказах в Настройках ' +\
                     '(/settings), если еще этого не сделали.'

    orders_over = 'Больше доступных заказов нет. 😥\n\n' + \
                  'Попробуйте обновить геопозицию или включить уведомления о новых заказах в Настройках ' + \
                  '(/settings), если еще этого не сделали.'


user_registration = UserRegistration()
my_profile = MyProfile()
general = General()
warnings = Warnings()
